# RT-DETR-L with BTD-SE V2.5-S on the P3 top-down fusion path.
nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, HGStem, [32, 48]]
  - [-1, 6, HGBlock, [48, 128, 3]]
  - [-1, 1, DWConv, [128, 3, 2, 1, False]]
  - [-1, 6, HGBlock, [96, 512, 3]]
  - [-1, 1, DWConv, [512, 3, 2, 1, False]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]
  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]

head:
  - [-1, 1, Conv, [256, 1, 1, null, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [7, 1, Conv, [256, 1, 1, null, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [null, 2, nearest]] # 18: upsampled Y4 (G)
  - [3, 1, Conv, [256, 1, 1, null, 1, 1, False]] # 19: input_proj.0 (P)
  - [[18, 19], 1, Concat, [1]]
  - [-1, 1, BTDSE, [256, 32, 1.0]] # returns concat(G, enhanced P)
  - [-1, 3, RepC3, [256]] # 22: enhanced P3
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 25: F4
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 28: F5
  - [[22, 25, 28], 1, RTDETRDecoder, [nc]]
